// Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.

//Console.WriteLine(" Введите пятизначное число: ");
 
 //int num = Convert.ToInt32(Console.ReadLine());

 //string text = Convert.ToString(num);

 
   //if ( text[0] == text[4] && text[1] == text[3])
   // {
          // Console.WriteLine(" Да!!");
   // }
   // else 
   // {
   //     Console.WriteLine(" Нет!");
  //  }



 