// 19. Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.

//Console.WriteLine(" Введите пятизначное число: ");
 
 //int num = Convert.ToInt32(Console.ReadLine());

 //string text = Convert.ToString(num);

 
   //if ( text[0] == text[4] && text[1] == text[3])
   // {
          // Console.WriteLine(" Да!!");
   // }
   // else 
   // {
   //     Console.WriteLine(" Нет!");
  //  }



 
 
 //21. Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 3D пространстве.


























 // 23. Напишите программу, которая принимает на вход число (N) и выдаёт таблицу кубов чисел от 1 до N.

// Console.WriteLine(" Введите число N: ");

// int num = Convert.ToInt32(Console.ReadLine());

    //for(int i = 1; i <= num; i++)
  //{
   // Console.WriteLine(Math.Pow(i, 3));
    
   //}

